app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if(@list.save)
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Pair programming"], ["created_at", "2020-12-08 08:00:49.908376"], ["updated_at", "2020-12-08 08:00:49.908376"]]