app/controllers/todos_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @list = List.find(params[:list_id])